<?php
    $a = 15;
    $b = 4;

    
    $addition = $a + $b;             // + (যোগ): দুই সংখ্যার যোগফল             => 15 + 4 = 19
    $subtraction = $a - $b;          // - (বিয়োগ): দুই সংখ্যার পার্থক্য             => 15 - 4 = 11 
    $multiplication = $a * $b;       // * (গুণ): দুই সংখ্যার গুণফল               => 15 * 4 = 60  
    $division = $a / $b;            // / (ভাগ): দুই সংখ্যার ভাগফল               => 15 / 4 = 3.75
    $modulus = $a % $b;             // % (মডুলো বা ভাগশেষ): ভাগশেষ বের করে     => 15 % 4 = 3 (কারণ 15 ÷ 4 = 3 বাকি 3)
    $exponentiation = $a ** $b;     // ** (ঘাত): এক সংখ্যার ঘাত অন্য সংখ্যা দ্বারা   => 15^4 = 15 * 15 * 15 * 15 = 50625 

    // আউটপুট দেখানো হচ্ছে
    echo "$addition<br>";          // আউটপুট: 19
    echo "$subtraction<br>";       // আউটপুট: 11
    echo "$multiplication<br>";    // আউটপুট: 60
    echo "$division<br>";          // আউটপুট: 3.75
    echo "$modulus<br>";           // আউটপুট: 3
    echo "$exponentiation<br>";    // আউটপুট: 50625
?>