<?php
 // প্রথমে $a কে ১০ দিয়ে ইনিশিয়ালাইজ করলাম
    $a = 10;                  

                              // += অপারেটর: $a এর সাথে ২ যোগ করবে এবং ফলাফল আবার $a তে রাখবে
    $a += 2;                  // মানে $a = $a + 2; => $a = 10 + 2 = 12
    echo "$a<br>";            // আউটপুট: 12

   // -----------------------------------------------------------------------

                               // -= অপারেটর: $a থেকে ২ বিয়োগ করবে
    $a -= 2;                   // $a = $a - 2; => 12 - 2 = 10
    echo "$a<br>";             // আউটপুট: 10

    //----------------------------------------------------------------------

                               // *= অপারেটর: $a কে ২ দিয়ে গুণ করবে
    $a *= 2;                   // $a = $a * 2; => 10 * 2 = 20
    echo "$a<br>";             // আউটপুট: 20

    //----------------------------------------------------------------------

                               // /= অপারেটর: $a কে ২ দিয়ে ভাগ করবে
    $a /= 2;                   // $a = $a / 2; => 20 / 2 = 10
    echo "$a<br>";             // আউটপুট: 10

    //----------------------------------------------------------------------

                              // %= অপারেটর: $a কে ২ দিয়ে ভাগের রিমাইন্ডার (বাকী) রাখবে
    $a %= 2;                  // $a = $a % 2; => 10 % 2 = 0 (কারণ 10 বিভাজ্য 2 দ্বারা)
    echo "$a<br>";            // আউটপুট: 0
?>