<?php 


$a = 5;                    // 🔸 ইনক্রিমেন্ট এবং ডিক্রিমেন্ট অপারেটর এর ব্যবহার 
$b = 5;

//---------------------------------------------------------------------------

                           // Post-decrement (প্রথমে মান রিটার্ন করে, পরে কমায়)
$c = $a--;                 // এখানে প্রথমে $a এর মান $c তে যায়, তারপর $a থেকে ১ কমে
echo "$c\n";               // আউটপুট: 5

//----------------------------------------------------------------------------

                         // Pre-decrement (প্রথমে মান কমায়, তারপর রিটার্ন করে)
$d = --$b;               // এখানে প্রথমে $b থেকে ১ কমে, তারপর সেই মান $d তে যায়
echo "$d\n";             // আউটপুট: 4
?>