<?php
// 🔸 স্ট্রিং কনক্যাটেনেশন অপারেটর (.)

// দুটি স্ট্রিং একত্রে জোড়া লাগাতে "dot" (.) অপারেটর ব্যবহার করা হয়

//-----------------------------------------------------------------------------


$firstName = "Humaun";                         // উদাহরণ ১: পুরো নাম তৈরি করা
$lastName = "Kabir";


$fullName = $firstName . " " . $lastName;      // এখানে $firstName এবং $lastName কে " " (স্পেস) সহ জোড়া লাগানো হয়েছে
echo "$fullName\n";                            // আউটপুট: Humaun kabir

//-------------------------------------------------------------------------------


$product = "Laptop";                          // উদাহরণ ২: প্রোডাক্টের নাম এবং দাম প্রিন্ট করা 
$price = 85000;


echo "Product Name: " . $product . ". Product price: " . $price . " BDT";  // স্ট্রিং এবং ভ্যারিয়েবল একসাথে প্রিন্ট করার জন্য . অপারেটর ব্যবহার করছি
?>