<?php
// 🔸 Spaceship Operator (<=>)
// PHP 7 থেকে যুক্ত হয়েছে। এটি দুটি মান compare করে এবং
// তিন ধরনের রেজাল্ট দিতে পারে: -1, 0, অথবা 1
//------------------------------------------------------------

// উদাহরণ ১:
$spaceShip1 = 3 <=> 5;          // ৩ ছোট ৫ এর চেয়ে, তাই আউটপুট হবে -1
echo "$spaceShip1\n";
//-------------------------------------------------------------

// উদাহরণ ২:
$spaceShip2 = 5 <=> 5;           // ৫ সমান ৫ এর, তাই আউটপুট হবে 0 
echo "$spaceShip2\n";
//-------------------------------------------------------------

// উদাহরণ ৩:
$spaceShip3 = 6 <=> 5;          // ৬ বড় ৫ এর চেয়ে, তাই আউটপুট হবে 1
echo "$spaceShip3\n";
?>