<?php

$score = 40;               // এখানে স্কোর ভ্যালু ৪০ সেট করা হয়েছে

if( $score >=80 ){         // যদি ৮০ বা তার বেশি হয়
    echo "A+\n";           // আউটপুট হবে A+
}elseif( $score >= 70 ){   // না হলে যদি ৭০ বা তার বেশি হয়
    echo "A\n";            // আউটপুট হবে A
}elseif( $score >= 60 ){   // না হলে যদি ৬০ বা তার বেশি হয়
    echo "A-\n";           // আউটপুট হবে A-
}elseif( $score >= 50 ){   // না হলে যদি ৫০ বা তার বেশি হয়
    echo "B\n";            // আউটপুট হবে B
}elseif( $score >= 40 ){   // না হলে যদি ৪০ বা তার বেশি হয়
    echo "C\n";            // আউটপুট হবে C
}elseif( $score >= 33 ){   // না হলে যদি ৩৩ বা তার বেশি হয়
    echo "D\n";            // আউটপুট হবে D
}else{                     // যদি কোনোটাই না হয় (৩৩ এর কম)
    echo "Failed";         // আউটপুট হবে Failed
}
?>



//----------------------------✅ নোট পয়েন্ট (বাংলায়):----------------------------------------------


1. if → প্রথম শর্ত চেক করে।


2. elseif → যদি আগের শর্ত মিথ্যা হয়, তবে নতুন শর্ত চেক করে।


3. else → যদি সব শর্ত মিথ্যা হয়, তাহলে এই কোড রান হবে।


4. \n → নতুন লাইন (Linux/Unix স্টাইল)।


5. $score এর মান বদলালে গ্রেডও বদলাবে।